import pygame

pygame.init()


#Записываем размеры нашего экрана
SCREEN_W =  pygame.display.Info().current_w
SCREEN_H =  pygame.display.Info().current_h
# Словарь со стандартными значениями карт
default_par_cards = {
    'клаус':[10,0,9],
    'бард':[7,2,4],
    'гигант':[12,3,9],
    'друид':[7,4,5],
    'подрывник':[8,5,12],
    'ями':[9,1,7],
    'арбалетчик':[9,3,9],
    'кентавр':[10,3,10],
    'орк':[10,1,9],
    'дворф':[5,2,7]

}

#Списки, хранящие информацию о картах игрока и врага
list_cards_en = [['подрывник',8,5],['кентавр',10,3],['арбалетчик',9,3],['клаус',10,0],['орк',10,1],['дворф',5,2]]#
list_cards_pl = [['дворф',5,2],['клаус',10,0],['подрывник',8,5],['кентавр',10,3],['ями',9,1,7],['арбалетчик',9,3]]

#Список со всеми объектами карт игрока, которые "живы"
list_cards_on_table_pl = []